Revit 2027 API
IFCAnyHandle.IsSubTypeOf Method
 Determines whether the instance is an instance of the specified instance type or a subtype of this instance type.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsSubTypeOf(
	string typeName
)
Public Function IsSubTypeOf (
	typeName As String
) As Boolean
public:
bool IsSubTypeOf(
	String^ typeName
)
member IsSubTypeOf :
        typeName : string -> bool
Parameters
typeName String
 The instance type name.
Return Value
Boolean
 True if the instance is an instance of the specified instance type or its subtype, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
IFCAnyHandle Class
Autodesk.Revit.DB.IFC Namespace